In [1]:
import pandas as pd

In [2]:
s = pd.Series(['2018-05-06','2018-05-17','2018-05-18'])

In [3]:
s

0    2018-05-06
1    2018-05-17
2    2018-05-18
dtype: object

In [4]:
d = pd.to_datetime(s)

In [5]:
d

0   2018-05-06
1   2018-05-17
2   2018-05-18
dtype: datetime64[ns]

In [6]:
d[0].year

2018

In [7]:
d[0].month

5

In [8]:
d[0].day

6

In [9]:
d.dt.year

0    2018
1    2018
2    2018
dtype: int64

In [10]:
d.dt.month

0    5
1    5
2    5
dtype: int64

In [11]:
d.dt.day

0     6
1    17
2    18
dtype: int64

In [12]:
df = pd.read_csv('../data/country_timeseries.csv', parse_dates=[0])

In [13]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
df['year'] = df['Date'].dt.year

In [15]:
df['month'] = df['Date'].dt.month

In [16]:
df[['Date','year','month']]

          Date  year  month
0   2015-01-05  2015      1
1   2015-01-04  2015      1
2   2015-01-03  2015      1
3   2015-01-02  2015      1
4   2014-12-31  2014     12
..         ...   ...    ...
117 2014-03-27  2014      3
118 2014-03-26  2014      3
119 2014-03-25  2014      3
120 2014-03-24  2014      3
121 2014-03-22  2014      3

[122 rows x 3 columns]

In [17]:
df['Date'].min()

Timestamp('2014-03-22 00:00:00')

In [18]:
df.index = df['Date']

In [19]:
df.index.min()

Timestamp('2014-03-22 00:00:00')